app/controllers/api/feeds_controller.rb

  def index
    # render :json => Feed.all
    render json: Feed.all, include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ?  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds"

  def show
    render json: Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ?  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]